// import logo from "./logo.svg";
import "./App.css";
import Logo from "./components/Logo/Logo";
import PaintingList from "./components/Painting/PaintingList";
import paintingJson from "./components/Data/paintings.json";
import Panel from "./components/Panel/Panel";

function App() {
  return (
    <div className="App">
      <header className="App-header">
        <Logo text="Логотип" />
        <Panel title="Свежие новости">
          <p>
            Ми робимо все, щоб ви мали змогу швидко, просто і комфортно придбати
            необхідні для вас матеріали. У нас є все, що тільки може знадобитися
            вам і вашим дітям: 1. Книжки для дітей різного віку, починаючи від
            дитячих казок для найменших і закінчуючи творами української та
            зарубіжної класики; 2. Підготовчі матеріали для майбутніх школярів
            (лист, рахунок, малювання, іноземні мови і т.д.). 3. Підручники за
            новою програмою, рекомендовані Міністерством освіти і науки, молоді
            та спорту України. 4. Підготовчі матеріали та тестові завдання для
            Зовнішнього незалежного оцінювання (укр .: Зовнішнє незалежне
            оцінювання (ЗНО)) і Державної підсумкової атестації (укр .: Державна
            підсумкова атестація (ДПА)).
          </p>
        </Panel>
        <Panel>
          <p>
            Ми робимо все, щоб ви мали змогу швидко, просто і комфортно придбати
            необхідні для вас матеріали. У нас є все, що тільки може знадобитися
            вам і вашим дітям: 1. Книжки для дітей різного віку, починаючи від
            дитячих казок для найменших і закінчуючи творами української та
            зарубіжної класики; 2. Підготовчі матеріали для майбутніх школярів
            (лист, рахунок, малювання, іноземні мови і т.д.). 3. Підручники за
            новою програмою, рекомендовані Міністерством освіти і науки, молоді
            та спорту України. 4. Підготовчі матеріали та тестові завдання для
            Зовнішнього незалежного оцінювання (укр .: Зовнішнє незалежне
            оцінювання (ЗНО)) і Державної підсумкової атестації (укр .: Державна
            підсумкова атестація (ДПА)).
          </p>
        </Panel>
        <PaintingList paintingJson={paintingJson} />
      </header>
    </div>
  );
}

export default App;
